// 함수
// 함수의 인자와 return
// 입력값 - input(매개변수)
// 함수가 작업을 수행하는 데 필요한 값
// 함수는 한 개 이상의 매개변수를 가질 수 있음
// 매개변수를 통해 외부로부터 데이터를 받아들일 수 있음

// 출력값 - output(반환값)
// 함수가 처리한 결과를 호출한 곳으로 반환함
// 함수는 return문을 사용하여 결과값을 반환할 수 있음

// return문과 console.log()의 차이점
// return문
// 역할
// 함수에서 값을 반환하고, 함수의 실행을 종료한다.
// 사용 목적
// 함수의 결과값을 반환하여 다른 부분의 코드에서 사용하거나,
// 다른 함수에 전달할 때 사용한다.
// 작동 방식
// return이 호출되면, 함수의 실행이 종료되고,
// return 뒤에 오는 표현식의 결과가 함수의 호출부로 반환한다.

// console.log()
// 역할
// 개발자 콘솔에 특정 값을 출력한다.
// 사용 목적
// 주로 디버깅 목적으로 사용되며,
// 변수의 값이나 함수의 실행 결과 등을 확인하는 데 사용
// 작동 방식
// console.log()에 전달된 값이 브라우저의 개발자 콘설이나
// Node.js의 터미널에 출력된다.
// 이는 프로그램의 흐름에 영향을 주지 않는다.
